app/controllers/students_controller.rb

    def update
        student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ana"], ["last_name", "Mendes"], ["created_at", "2019-12-16 08:59:28.637095"], ["updated_at", "2019-12-16 08:59:28.637095"]]