app/controllers/students_controller.rb

    def create
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ana"], ["last_name", "Robalo"], ["created_at", "2019-12-16 08:48:29.492160"], ["updated_at", "2019-12-16 08:48:29.492160"]]

    def update
        @student = Student.find(params[:id])
        @student.update(params.require(:student).permit(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "testing_edit"], ["updated_at", "2019-12-15 20:10:21.050280"], ["id", 1]]